bczwartk/ST_Drone_FCU_F401/STM32 FW Project/Official release with BLE Remocon - 170318/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  *
  * COPYRIGHT(c) 2017 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"
#include "usb_device.h"

/* USER CODE BEGIN Includes */
#include "main.h"
#include "def32.h"
#include "debug.h"
#include "config_drone.h"
#include "timer.h"
#include "rc.h"
#include "steval_fcu001_v1.h"
#include "steval_fcu001_v1_accelero.h"
#include "steval_fcu001_v1_gyro.h"
#include "steval_fcu001_v1_magneto.h"
#include "steval_fcu001_v1_pressure.h"
#include "steval_fcu001_v1_temperature.h"
#include "sensor_data.h"
#include "quaternion.h"
#include "ahrs.h"
#include "flight_control.h"
#include "motor.h"
#include "ble_status.h"
#include "SPBTLE_RF.h"
#include "bluenrg_gatt_server.h"
#include "sensor_service.h"
#include "bluenrg_utils.h"
#include "TargetFeatures.h"

#include "bluenrg_l2cap_aci.h"

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
volatile uint32_t HCI_ProcessEvent = 0u;
extern uint8_t joydata[8];
uint8_t joydata[8] = {0,0,0,0,0,0,0,0};

static ADC_HandleTypeDef hadc1;

extern SPI_HandleTypeDef hspi1, hspi2;
SPI_HandleTypeDef hspi1;
SPI_HandleTypeDef hspi2;

extern TIM_HandleTypeDef htim2, htim4, htim9;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim4;
TIM_HandleTypeDef htim9;

extern UART_HandleTypeDef huart1;
UART_HandleTypeDef huart1;

static void *LSM6DSL_X_0_handle = NULL;
static void *LSM6DSL_G_0_handle = NULL;
static void *LIS2MDL_M_0_handle = NULL;
static void *LPS22HB_P_0_handle = NULL;
static void *LPS22HB_T_0_handle = NULL; 

extern int16_t gAIL, gELE, gTHR, gRUD;
int32_t rc_cal_flag = 0;
uint8_t rc_enable_motor = 0u;
int32_t fly_ready = 0;
// uint8_t ch, ch_flag;

extern uint32_t tim9_event_flag, tim9_cnt, tim9_cnt2;
uint32_t tim9_event_flag = 0u, tim9_cnt = 0u, tim9_cnt2 = 0u;

/* BLE module */
extern DrvStatusTypeDef testStatus;
DrvStatusTypeDef testStatus = COMPONENT_OK;
extern uint8_t test_res_global, testEvent, bdaddr[6];
uint8_t test_res_global = 0u;
uint8_t testEvent = 0u;
uint8_t bdaddr[6];


/* Private function prototypes -----------------------------------------------*/
static void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_ADC1_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM4_Init(void);
static void MX_TIM9_Init(void);
static void MX_USART1_UART_Init(void);

static void initializeAllSensors( void );
static void enableAllSensors( void );

static void BlueNRG_Init(void);
static void Init_BlueNRG_Custom_Services(void);
static void SendMotionData(void);
static void SendBattEnvData(void);
static void SendArmingData(void);



/* USER CODE BEGIN 0 */
static P_PI_PIDControlTypeDef pid;
static EulerAngleTypeDef euler_rc, euler_ahrs;
static AxesRaw_TypeDef acc, gyro, mag;
static AxesRaw_TypeDef_Float acc_ahrs_FIFO[FIFO_Order], acc_ahrs;
static AxesRaw_TypeDef_Float gyro_fil, gyro_y_pre[4], gyro_x_pre[4];
static AxesRaw_TypeDef_Float gyro_ahrs_FIFO[FIFO_Order], gyro_ahrs;
static AxesRaw_TypeDef acc_off_calc, gyro_off_calc, acc_offset, gyro_offset;
int32_t gyro_cali_count = 0;

typedef struct
{
  float32_t a1, a2, b0, b1, b2;
} IIR_Coeff;

extern uint8_t tmp_lis2mdl;
extern SensorAxes_t tmp_mag;
extern uint32_t ConnectionBleStatus;

static MotorControlTypeDef motor_pwm;
static float32_t press;
static float32_t temperature;

uint8_t tmp_lis2mdl;
SensorAxes_t tmp_mag;

/* BLE */
uint32_t ConnectionBleStatus = 0u;
uint8_t BufferToWrite[256] = { 0u };
int32_t BytesToWrite = 0;

/* USER CODE END 0 */

int main(void)
{
  /* USER CODE BEGIN 1 */
  int16_t pid_interval;
  uint16_t i;
  int32_t mytimcnt = 0;
  
  static AHRS_State_TypeDef ahrs;
  static int16_t gJoystick_status = 0;
  static int32_t count1 = 0, count2 = 0;
  static float32_t press_zero_level = 0.0f;
  static EulerAngleTypeDef euler_rc_fil = {0.0f, 0.0f, 0.0f };

  gyro_fil.AXIS_X = 0.0f;
  gyro_fil.AXIS_Y = 0.0f;
  gyro_fil.AXIS_Z = 0.0f;
  euler_rc_fil.thx = 0.0f;
  euler_rc_fil.thy = 0.0f;
  euler_rc_fil.thz = 0.0f;
  acc_off_calc.AXIS_X = 0;
  acc_off_calc.AXIS_Y = 0;
  acc_off_calc.AXIS_Z = 0;
  gyro_off_calc.AXIS_X = 0;
  gyro_off_calc.AXIS_Y = 0;
  gyro_off_calc.AXIS_Z = 0;
  acc_offset.AXIS_X = 0;
  acc_offset.AXIS_Y = 0;
  acc_offset.AXIS_Z = 1000;
  gyro_offset.AXIS_X = 0;
  gyro_offset.AXIS_Y = 0;
  gyro_offset.AXIS_Z = 0;
  euler_rc.thz = euler_ahrs.thz;

  for (i = 0u; i < 4u; i++) {
    gyro_y_pre[i].AXIS_X = 0.0f;
    gyro_y_pre[i].AXIS_Y = 0.0f;
    gyro_y_pre[i].AXIS_Z = 0.0f;
    gyro_x_pre[i].AXIS_X = 0.0f;
    gyro_x_pre[i].AXIS_Y = 0.0f;
    gyro_x_pre[i].AXIS_Z = 0.0f;
  }

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  (void)HAL_Init();

  /* Configure the system clock */
  SystemClock_Config();

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_ADC1_Init();  
  MX_TIM2_Init();
  MX_TIM4_Init();
  MX_TIM9_Init();
  MX_USART1_UART_Init();
 
  /* USER CODE BEGIN 2 */

