bczwartk/ST_Drone_FCU_F401/STM32 FW Project/Official release with BLE Remocon - 170318/Src/main.c
      // Calculate euler angle drone
      QuaternionToEuler(&ahrs.q, &euler_ahrs);

      //BSP_LED_Toggle(LED1);
      
      #ifdef REMOCON_BLE
      
 
//          gRUD = (joydata[3]-128)*(-13);
//          gTHR = joydata[4]*13;
//          gAIL = (joydata[5]-128)*(-13);
//          gELE = (joydata[6]-128)*13;
          gRUD = (joydata[2] - 128) * (-13);
          gTHR = joydata[3] * 13;
          gAIL = (joydata[4] - 128) * (-13);
          gELE = (joydata[5] - 128) * 13;
          
          /* joydata[6]: seek bar data*/
          /* joydata[7]: additional button data
                        first bit: Takeoff (0 = Land,  1 = Takeoff)
                        second bit: Calibration When it changes status is active
                        third bit: Arming (0 = Disarmed,  1 = Armed) */
          gJoystick_status = joydata[7];
          if ((gJoystick_status & 0x04u) == 0x04u) {
            rc_enable_motor = 1u;
            fly_ready = 1;
            BSP_LED_On(LED2);
          } else {
            rc_enable_motor = 0u;
            fly_ready = 0;
          }

          if (TRUE == connected) {
            rc_connection_flag = 1u;                       /* BLE Remocon connected flag for enabling motor output */
            SendMotionData();
            SendBattEnvData();
            SendArmingData();            
          } else {
            rc_connection_flag = 0u;
            gTHR = 0;
            rc_enable_motor = 0u;
            fly_ready = 0;
            BSP_LED_Off(LED1);
            BSP_LED_Off(LED2);
          }
          
          if (0u != (joydata[7] & 0x02u)) {
            rc_cal_flag = 1;
            BSP_LED_On(LED1);
          }
      #endif
          
      #ifdef REMOCON_PWM
          if ( (gTHR == 0) && (gELE < - RC_CAL_THRESHOLD) && (gAIL > RC_CAL_THRESHOLD) && (gRUD < - RC_CAL_THRESHOLD))
          {
            rc_cal_flag = 1;
            BSP_LED_On(LED1);
          }
           
      
          if ( (gTHR == 0) && (gELE < - RC_CAL_THRESHOLD) && (gAIL < - RC_CAL_THRESHOLD) && (gRUD > RC_CAL_THRESHOLD))
          {
            rc_enable_motor = 1;
            fly_ready = 1;
            BSP_LED_On(LED2);          
          }
      #endif
      
      // Get target euler angle from remote control
      GetTargetEulerAngle(&euler_rc, &euler_ahrs);

      if (gTHR < MIN_THR) {
        euler_rc.thz = 0.0f;
        euler_ahrs.thz = 0.0f;
      }

      euler_rc_fil.thx = euler_rc.thx;
      euler_rc_fil.thy = euler_rc.thy;
      euler_rc_fil.thz = euler_rc.thz;
      
      FlightControlPID_OuterLoop(&euler_rc_fil, &euler_ahrs, &pid);
      
    /* Added for debug on UART*/
    /* Remocon ELE, AIL, RUD, THR, AHRS Euler angle x and y axis, Remocon Euler angle x and y axis */
    //PRINTF("%d\t%d\t%d\t%d\t%f\t%f\t%f\t%f\n", gELE, gAIL, gRUD, gTHR, euler_ahrs.thx * 57.3f, euler_ahrs.thy * 57.3f, euler_rc.thx * 57.3f, euler_rc.thy * 57.3f);
    /* Remocon ELE, AIL, RUD, THR, Motor1_pwm, AHRS Euler angle x and y axis */
    //PRINTF("%d\t%d\t%d\t%d\t%f\t%f\t%f\t%f\t%f\n", gELE, gAIL, gRUD, gTHR, motor_pwm.motor1_pwm, euler_ahrs.thx * 57.3f, euler_ahrs.thy * 57.3f, euler_rc.thx * 57.3f, euler_rc.thy * 57.3f);
    //PRINTF("%d\t%d\t%d\t%d\n", gELE, gAIL, gRUD, gTHR);
    /* Remocon THR, Acc and Gyro FIFO data x and y axis, AHRS Euler angle x and y axis, Remocon Euler angle x and y axis*/
    //PRINTF("%d\t%f\t%f\t%f\t%f\t%f\t%f\t%f\t%f\n", gTHR, acc_ahrs.AXIS_X, acc_ahrs.AXIS_Y, gyro_ahrs.AXIS_X, gyro_ahrs.AXIS_Y, euler_ahrs.thx * 57.3f, euler_ahrs.thy * 57.3f, euler_rc.thx * 57.3f, euler_rc.thy * 57.3f);
    /* MEMS Accelerometer RAW data */
    //PRINTF("%d\t%d\t%d\t\n", acc.AXIS_X, acc.AXIS_Y, acc.AXIS_Z);
      
    /* Pressure data on UART for debug*/
    //PRINTF("Pressure [atm] = %f\n\n",pre);  
    /* Magnetometer data on UART for debug*/
    //PRINTF("Magnetometer X = %d\tY = %d\tZ = %d\n\n", mag.AXIS_X, mag.AXIS_Y, mag.AXIS_Z);  


    }

  if (0u != isTimerEventExist(&tim)) {    // Check if a timer event is present
        ClearTimer(&tim);           // Clear current event;

        count2 ++;

        mytimcnt ++;
        if ((rc_connection_flag != 0u) && (rc_enable_motor != 0u)) {
          if ((mytimcnt % 50) == 0) {
            BSP_LED_On(LED2);
          }
        } else {
          if ((mytimcnt % 50) == 0) {
            BSP_LED_Toggle(LED2);
          }
        }
    }
  }
#pragma diag_suppress = Pe111
  return 0; /* not reachable - just to make MISRAC2012-RULE_17_4-a happy */
#pragma diag_warning = Pe111
  /* USER CODE END 3 */
}

/** System Clock Configuration
*/
static void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;

    /**Configure the main internal regulator output voltage 
    */
  __HAL_RCC_PWR_CLK_ENABLE();

  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE2);

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 16;
  RCC_OscInitStruct.PLL.PLLN = 336;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV4;
  RCC_OscInitStruct.PLL.PLLQ = 7;

  (void) HAL_RCC_OscConfig(&RCC_OscInitStruct);
  
    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
  (void) HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2);

    /**Configure the Systick interrupt time 
    */
  (void) HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq() / 1000u);

    /**Configure the Systick 
    */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0u, 0u);
}

/* ADC1 init function */
static void MX_ADC1_Init(void)
{
  ADC_ChannelConfTypeDef sConfig;

    /**Configure the global features of the ADC (Clock, Resolution, Data Alignment and number of conversion)
    */
  hadc1.Instance = ADC1;
  hadc1.Init.ClockPrescaler = ADC_CLOCKPRESCALER_PCLK_DIV4;
  hadc1.Init.Resolution = ADC_RESOLUTION12b;
  hadc1.Init.ScanConvMode = DISABLE;
  hadc1.Init.ContinuousConvMode = DISABLE;
  hadc1.Init.DiscontinuousConvMode = DISABLE;
  hadc1.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
  hadc1.Init.DataAlign = ADC_DATAALIGN_RIGHT;
  hadc1.Init.NbrOfConversion = 1;
  hadc1.Init.DMAContinuousRequests = DISABLE;
  hadc1.Init.EOCSelection = EOC_SINGLE_CONV;
  (void)HAL_ADC_Init(&hadc1);

    /**Configure for the selected ADC regular channel its corresponding rank in the sequencer and its sample time.
    */
  sConfig.Channel = ADC_CHANNEL_9;
  sConfig.Rank = 1;
  sConfig.SamplingTime = ADC_SAMPLETIME_3CYCLES;
  (void)HAL_ADC_ConfigChannel(&hadc1, &sConfig);

