bczwartk/ST_Drone_FCU_F401/STM32 FW Project/Official release with BLE Remocon - 170318/Src/main.c
        sensor_init_cali_count = 0;
        sensor_init_cali = 1;
      }
    }
  }

  if (sensor_init_cali == 1) {
    tim9_cnt++;
    tim9_cnt2++;

    // Read sensor data and prepare for specific coodinate system
    ReadSensorRawData(LSM6DSL_X_0_handle, LSM6DSL_G_0_handle, LIS2MDL_M_0_handle, LPS22HB_P_0_handle, &acc, &gyro, &mag, &press);
    
    if (rc_cal_flag == 1) {
      acc_off_calc.AXIS_X += acc.AXIS_X;
      acc_off_calc.AXIS_Y += acc.AXIS_Y;
      acc_off_calc.AXIS_Z += acc.AXIS_Z;

      gyro_off_calc.AXIS_X += gyro.AXIS_X;
      gyro_off_calc.AXIS_Y += gyro.AXIS_Y;
      gyro_off_calc.AXIS_Z += gyro.AXIS_Z;

      rc_cal_cnt++;

      if (rc_cal_cnt >= 800) {
        acc_offset.AXIS_X = (int32_t) (acc_off_calc.AXIS_X * 0.00125f);
        acc_offset.AXIS_Y = (int32_t) (acc_off_calc.AXIS_Y * 0.00125f);
        acc_offset.AXIS_Z = (int32_t) (acc_off_calc.AXIS_Z * 0.00125f);

        gyro_offset.AXIS_X = (int32_t) (gyro_off_calc.AXIS_X * 0.00125f);
        gyro_offset.AXIS_Y = (int32_t) (gyro_off_calc.AXIS_Y * 0.00125f);
        gyro_offset.AXIS_Z = (int32_t) (gyro_off_calc.AXIS_Z * 0.00125f);

        acc_off_calc.AXIS_X = 0;
        acc_off_calc.AXIS_Y = 0;
        acc_off_calc.AXIS_Z = 0;
        gyro_off_calc.AXIS_X = 0;
        gyro_off_calc.AXIS_Y = 0;
        gyro_off_calc.AXIS_Z = 0;

        rc_cal_cnt = 0;
        rc_cal_flag = 0;
      }
    }

    acc.AXIS_X -= acc_offset.AXIS_X;
    acc.AXIS_Y -= acc_offset.AXIS_Y;
    acc.AXIS_Z -= (acc_offset.AXIS_Z - 1000);
    gyro.AXIS_X -= gyro_offset.AXIS_X;
    gyro.AXIS_Y -= gyro_offset.AXIS_Y;
    gyro.AXIS_Z -= gyro_offset.AXIS_Z;

    // Save filtered data to acc_FIFO
    acc_FIFO[tim9_cnt2 - 1u].AXIS_X = acc.AXIS_X;
    acc_FIFO[tim9_cnt2 - 1u].AXIS_Y = acc.AXIS_Y;
    acc_FIFO[tim9_cnt2 - 1u].AXIS_Z = acc.AXIS_Z;

    // IIR Filtering on gyro
    gyro_fil.AXIS_X = (gyro_fil_coeff.b0 * gyro.AXIS_X) + (gyro_fil_coeff.b1 * gyro_x_pre[0].AXIS_X) + (gyro_fil_coeff.b2 * gyro_x_pre[1].AXIS_X)
                                                    + (gyro_fil_coeff.a1 * gyro_y_pre[0].AXIS_X) + (gyro_fil_coeff.a2 * gyro_y_pre[1].AXIS_X);
    gyro_fil.AXIS_Y = (gyro_fil_coeff.b0 * gyro.AXIS_Y) + (gyro_fil_coeff.b1 * gyro_x_pre[0].AXIS_Y) + (gyro_fil_coeff.b2 * gyro_x_pre[1].AXIS_Y)
                                                    + (gyro_fil_coeff.a1 * gyro_y_pre[0].AXIS_Y) + (gyro_fil_coeff.a2 * gyro_y_pre[1].AXIS_Y);
    gyro_fil.AXIS_Z = (gyro_fil_coeff.b0 * gyro.AXIS_Z) + (gyro_fil_coeff.b1 * gyro_x_pre[0].AXIS_Z) + (gyro_fil_coeff.b2 * gyro_x_pre[1].AXIS_Z)
                                                    + (gyro_fil_coeff.a1 * gyro_y_pre[0].AXIS_Z) + (gyro_fil_coeff.a2 * gyro_y_pre[1].AXIS_Z);
    // Shift IIR filter state
    for (int32_t i = 1; i > 0; i--) {
      gyro_x_pre[i].AXIS_X = gyro_x_pre[i - 1].AXIS_X;
      gyro_x_pre[i].AXIS_Y = gyro_x_pre[i - 1].AXIS_Y;
      gyro_x_pre[i].AXIS_Z = gyro_x_pre[i - 1].AXIS_Z;
      gyro_y_pre[i].AXIS_X = gyro_y_pre[i - 1].AXIS_X;
      gyro_y_pre[i].AXIS_Y = gyro_y_pre[i - 1].AXIS_Y;
      gyro_y_pre[i].AXIS_Z = gyro_y_pre[i - 1].AXIS_Z;
    }
    gyro_x_pre[0].AXIS_X = gyro.AXIS_X;
    gyro_x_pre[0].AXIS_Y = gyro.AXIS_Y;
    gyro_x_pre[0].AXIS_Z = gyro.AXIS_Z;
    gyro_y_pre[0].AXIS_X = gyro_fil.AXIS_X;
    gyro_y_pre[0].AXIS_Y = gyro_fil.AXIS_Y;
    gyro_y_pre[0].AXIS_Z = gyro_fil.AXIS_Z;

    //  Save filtered data to gyro_FIFO
    gyro_FIFO[tim9_cnt2 - 1u].AXIS_X = gyro_fil.AXIS_X;
    gyro_FIFO[tim9_cnt2 - 1u].AXIS_Y = gyro_fil.AXIS_Y;
    gyro_FIFO[tim9_cnt2 - 1u].AXIS_Z = gyro_fil.AXIS_Z;
    

    if (tim9_cnt2 == FIFO_Order) {
      tim9_cnt2 = 0u;
      tim9_event_flag = 1u;
      for (int32_t i = 0; i < FIFO_Order; i++) {
        acc_ahrs_FIFO[i].AXIS_X = acc_FIFO[i].AXIS_X;
        acc_ahrs_FIFO[i].AXIS_Y = acc_FIFO[i].AXIS_Y;
        acc_ahrs_FIFO[i].AXIS_Z = acc_FIFO[i].AXIS_Z;
        gyro_ahrs_FIFO[i].AXIS_X = gyro_FIFO[i].AXIS_X;
        gyro_ahrs_FIFO[i].AXIS_Y = gyro_FIFO[i].AXIS_Y;
        gyro_ahrs_FIFO[i].AXIS_Z = gyro_FIFO[i].AXIS_Z;
      }
    }

      
    gyro_in_rad.gx = ((float32_t)gyro_fil.AXIS_X) * ((float32_t)COE_MDPS_TO_RADPS);
    gyro_in_rad.gy = ((float32_t)gyro_fil.AXIS_Y) * ((float32_t)COE_MDPS_TO_RADPS);
    gyro_in_rad.gz = ((float32_t)gyro_fil.AXIS_Z) * ((float32_t)COE_MDPS_TO_RADPS);

      euler_ahrs.thz += gyro_in_rad.gz * PID_SAMPLING_TIME;

      if (gTHR < MIN_THR) {
        euler_rc.thz = 0.0f;
        euler_ahrs.thz = 0.0f;
      }

      if ((rc_connection_flag != 0u) && (rc_enable_motor != 0u)) {
    	// Do PID Control
        FlightControlPID_innerLoop(&gyro_in_rad, &pid, &motor_pwm);
      } else {
        // set motor output zero
        set_motor_pwm_zero(&motor_pwm);
      }

      if (gTHR < MIN_THR) {
        set_motor_pwm_zero(&motor_pwm);
      }

      set_motor_pwm(&motor_pwm);      /* To comment if want to debug remocon calibration switching off the motors */
  }
}


/**
* @brief  Initialize all sensors
* @param  None
* @retval None
*/
static void initializeAllSensors( void )
{
  if (BSP_ACCELERO_Init( LSM6DSL_X_0, &LSM6DSL_X_0_handle ) != COMPONENT_OK) {
    while (1) {}
  }
  
  if (BSP_GYRO_Init( LSM6DSL_G_0, &LSM6DSL_G_0_handle ) != COMPONENT_OK) {
    while (1) {}
  }
  
  if (BSP_MAGNETO_Init( LIS2MDL_M_0, &LIS2MDL_M_0_handle ) != COMPONENT_OK) {
    while (1) {}
  }
  
  if (BSP_PRESSURE_Init( LPS22HB_P_0, &LPS22HB_P_0_handle ) != COMPONENT_OK) {
    while (1) {}
  }

  if (BSP_TEMPERATURE_Init( LPS22HB_T_0, &LPS22HB_T_0_handle ) != COMPONENT_OK) {
    while (1) {}
  }
}

/**
* @brief  Enable all sensors
* @param  None
* @retval None
*/
static void enableAllSensors( void )
{
  (void)BSP_ACCELERO_Sensor_Enable( LSM6DSL_X_0_handle );
  (void)PRINTF("LSM6DSL MEMS Accelerometer initialized and enabled\n");
  (void)BSP_GYRO_Sensor_Enable( LSM6DSL_G_0_handle );
  (void)PRINTF("LSM6DSL MEMS Gyroscope initialized and enabled\n");
  (void)BSP_MAGNETO_Sensor_Enable( LIS2MDL_M_0_handle );
  (void)PRINTF("LIS2MDL Magnetometer initialized and enabled\n");
  (void)BSP_PRESSURE_Sensor_Enable( LPS22HB_P_0_handle );
  (void)PRINTF("LPS22HB Pressure sensor initialized and enabled\n");
  (void)BSP_TEMPERATURE_Sensor_Enable( LPS22HB_T_0_handle );
  (void)PRINTF("LPS22HB Temperature sensor initialized and enabled\n");
}



static void BlueNRG_Init(void)
{
  tBleStatus ret = 1u;
  uint8_t  hwVersion = 0u;
  uint16_t fwVersion = 0u;
  uint16_t service_handle = 0u;
  uint16_t dev_name_char_handle = 0u;
  uint16_t appearance_char_handle = 0u;
  
  PRINTF("****** START BLE TESTS ******\r\n");
  BNRG_SPI_Init();

  uint8_t tmp_bdaddr[6] = {MAC_BLUEMS};
  int32_t i;
  for (i = 0; i < 6; i++) {
    bdaddr[i] = tmp_bdaddr[i];
  }
  
